hisyamfs/esp32-ta/lib/myBluetoothSerial/myBluetoothSerial.cpp
    case ESP_SPP_SRV_OPEN_EVT: //Server connection open
        log_i("ESP_SPP_SRV_OPEN_EVT");
        if (!_spp_client)
        {
            _spp_client = param->open.handle;
        }
        else
        {
            secondConnectionAttempt = true;
            esp_spp_disconnect(param->open.handle);
        }
        xEventGroupClearBits(_spp_event_group, SPP_DISCONNECTED);
        xEventGroupSetBits(_spp_event_group, SPP_CONNECTED);
        break;

    case ESP_SPP_CLOSE_EVT: //Client connection closed
        log_i("ESP_SPP_CLOSE_EVT");
        if (secondConnectionAttempt)
        {
            secondConnectionAttempt = false;
        }
        else
        {
            _spp_client = 0;
            xEventGroupSetBits(_spp_event_group, SPP_DISCONNECTED);
        }
        xEventGroupClearBits(_spp_event_group, SPP_CONNECTED);
        break;

    case ESP_SPP_CONG_EVT: //connection congestion status changed
        if (param->cong.cong)
        {
            xEventGroupClearBits(_spp_event_group, SPP_CONGESTED);
        }
        else
        {
            xEventGroupSetBits(_spp_event_group, SPP_CONGESTED);
        }
        log_v("ESP_SPP_CONG_EVT: %s", param->cong.cong ? "CONGESTED" : "FREE");
        break;

    case ESP_SPP_WRITE_EVT: //write operation completed
        if (param->write.cong)
        {
            xEventGroupClearBits(_spp_event_group, SPP_CONGESTED);
        }
        xSemaphoreGive(_spp_tx_done); //we can try to send another packet
        log_v("ESP_SPP_WRITE_EVT: %u %s", param->write.len, param->write.cong ? "CONGESTED" : "FREE");
        break;

    case ESP_SPP_DATA_IND_EVT: //connection received data
        log_v("ESP_SPP_DATA_IND_EVT len=%d handle=%d", param->data_ind.len, param->data_ind.handle);
        //esp_log_buffer_hex("",param->data_ind.data,param->data_ind.len); //for low level debug
        //ets_printf("r:%u\n", param->data_ind.len);

        if (custom_data_callback)
        {
            custom_data_callback(param->data_ind.data, param->data_ind.len);
        }
        else if (_spp_rx_queue != NULL)
        {
            for (int i = 0; i < param->data_ind.len; i++)
            {
                if (xQueueSend(_spp_rx_queue, param->data_ind.data + i, (TickType_t)0) != pdTRUE)
                {
                    log_e("RX Full! Discarding %u bytes", param->data_ind.len - i);
                    break;
                }
            }
        }
        break;

    case ESP_SPP_DISCOVERY_COMP_EVT: //discovery complete
        log_i("ESP_SPP_DISCOVERY_COMP_EVT");
        if (param->disc_comp.status == ESP_SPP_SUCCESS)
        {
            log_i("ESP_SPP_DISCOVERY_COMP_EVT: spp connect to remote");
            esp_spp_connect(ESP_SPP_SEC_AUTHENTICATE, ESP_SPP_ROLE_MASTER, param->disc_comp.scn[0], _peer_bd_addr);
        }
        break;

    case ESP_SPP_OPEN_EVT: //Client connection open
        log_i("ESP_SPP_OPEN_EVT");
        if (!_spp_client)
        {
            _spp_client = param->open.handle;
        }
        else
        {
            secondConnectionAttempt = true;
            esp_spp_disconnect(param->open.handle);
        }
        xEventGroupClearBits(_spp_event_group, SPP_DISCONNECTED);
        xEventGroupSetBits(_spp_event_group, SPP_CONNECTED);
        break;

    case ESP_SPP_START_EVT: //server started
        log_i("ESP_SPP_START_EVT");
        break;

    case ESP_SPP_CL_INIT_EVT: //client initiated a connection
        log_i("ESP_SPP_CL_INIT_EVT");
        break;

    default:
        break;
    }
    if (custom_spp_callback)
        (*custom_spp_callback)(event, param);
}

void myBluetoothSerial::onData(myBluetoothSerialDataCb cb)
{
    custom_data_callback = cb;
}

static void esp_bt_gap_cb(esp_bt_gap_cb_event_t event, esp_bt_gap_cb_param_t *param)
{
    switch (event)
    {
    case ESP_BT_GAP_DISC_RES_EVT:
        log_i("ESP_BT_GAP_DISC_RES_EVT");
#if (ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO)
        char bda_str[18];
        log_i("Scanned device: %s", bda2str(param->disc_res.bda, bda_str, 18));
#endif
        for (int i = 0; i < param->disc_res.num_prop; i++)
        {
            uint8_t peer_bdname_len;
            char peer_bdname[ESP_BT_GAP_MAX_BDNAME_LEN + 1];
            switch (param->disc_res.prop[i].type)
            {
            case ESP_BT_GAP_DEV_PROP_EIR:
                if (get_name_from_eir((uint8_t *)param->disc_res.prop[i].val, peer_bdname, &peer_bdname_len))
                {
                    log_i("ESP_BT_GAP_DISC_RES_EVT : EIR : %s : %d", peer_bdname, peer_bdname_len);
                    if (strlen(_remote_name) == peer_bdname_len && strncmp(peer_bdname, _remote_name, peer_bdname_len) == 0)
                    {
                        log_v("ESP_BT_GAP_DISC_RES_EVT : SPP_START_DISCOVERY_EIR : %s", peer_bdname, peer_bdname_len);
                        _isRemoteAddressSet = true;
                        memcpy(_peer_bd_addr, param->disc_res.bda, ESP_BD_ADDR_LEN);
                        esp_bt_gap_cancel_discovery();
                        esp_spp_start_discovery(_peer_bd_addr);
                    }
                }
                break;

            case ESP_BT_GAP_DEV_PROP_BDNAME:
                peer_bdname_len = param->disc_res.prop[i].len;
                memcpy(peer_bdname, param->disc_res.prop[i].val, peer_bdname_len);
                peer_bdname_len--; // len includes 0 terminator
                log_v("ESP_BT_GAP_DISC_RES_EVT : BDNAME :  %s : %d", peer_bdname, peer_bdname_len);
                if (strlen(_remote_name) == peer_bdname_len && strncmp(peer_bdname, _remote_name, peer_bdname_len) == 0)
                {
                    log_i("ESP_BT_GAP_DISC_RES_EVT : SPP_START_DISCOVERY_BDNAME : %s", peer_bdname);
                    _isRemoteAddressSet = true;
                    memcpy(_peer_bd_addr, param->disc_res.bda, ESP_BD_ADDR_LEN);
                    esp_bt_gap_cancel_discovery();
                    esp_spp_start_discovery(_peer_bd_addr);
                }
                break;

            case ESP_BT_GAP_DEV_PROP_COD:
                log_d("ESP_BT_GAP_DEV_PROP_COD");
                break;

            case ESP_BT_GAP_DEV_PROP_RSSI:
                log_d("ESP_BT_GAP_DEV_PROP_RSSI");
                break;

            default:
                break;
            }
            if (_isRemoteAddressSet)
                break;
        }
        break;
    case ESP_BT_GAP_DISC_STATE_CHANGED_EVT:
        log_i("ESP_BT_GAP_DISC_STATE_CHANGED_EVT");
        break;

    case ESP_BT_GAP_RMT_SRVCS_EVT:
        log_i("ESP_BT_GAP_RMT_SRVCS_EVT");
        break;

    case ESP_BT_GAP_RMT_SRVC_REC_EVT:
        log_i("ESP_BT_GAP_RMT_SRVC_REC_EVT");
        break;

    case ESP_BT_GAP_AUTH_CMPL_EVT:
        if (param->auth_cmpl.stat == ESP_BT_STATUS_SUCCESS)
        {
            log_v("authentication success: %s", param->auth_cmpl.device_name);
        }
        else
        {
            log_e("authentication failed, status:%d", param->auth_cmpl.stat);
        }
        break;

    case ESP_BT_GAP_PIN_REQ_EVT:
        // default pairing pins
        log_i("ESP_BT_GAP_PIN_REQ_EVT min_16_digit:%d", param->pin_req.min_16_digit);
        if (param->pin_req.min_16_digit)
        {
            log_i("Input pin code: 0000 0000 0000 0000");
            esp_bt_pin_code_t pin_code;
            memset(pin_code, '0', ESP_BT_PIN_CODE_LEN);
            esp_bt_gap_pin_reply(param->pin_req.bda, true, 16, pin_code);
        }
        else
        {
            log_i("Input pin code: 1234");
            esp_bt_pin_code_t pin_code;
            memcpy(pin_code, "1234", 4);
            esp_bt_gap_pin_reply(param->pin_req.bda, true, 4, pin_code);
        }
        break;

    case ESP_BT_GAP_CFM_REQ_EVT:
        log_i("ESP_BT_GAP_CFM_REQ_EVT Please compare the numeric value: %d", param->cfm_req.num_val);
        esp_bt_gap_ssp_confirm_reply(param->cfm_req.bda, true);
        break;

    case ESP_BT_GAP_KEY_NOTIF_EVT:
        log_i("ESP_BT_GAP_KEY_NOTIF_EVT passkey:%d", param->key_notif.passkey);
        break;

    case ESP_BT_GAP_KEY_REQ_EVT:
        log_i("ESP_BT_GAP_KEY_REQ_EVT Please enter passkey!");
        break;

    default:
        break;
    }
}

static bool _init_bt(const char *deviceName)
{
    if (!_spp_event_group)
    {
        _spp_event_group = xEventGroupCreate();
        if (!_spp_event_group)
        {
            log_e("SPP Event Group Create Failed!");
            return false;
        }
        xEventGroupClearBits(_spp_event_group, 0xFFFFFF);
        xEventGroupSetBits(_spp_event_group, SPP_CONGESTED);
        xEventGroupSetBits(_spp_event_group, SPP_DISCONNECTED);
    }
    if (_spp_rx_queue == NULL)
    {
        _spp_rx_queue = xQueueCreate(RX_QUEUE_SIZE, sizeof(uint8_t)); //initialize the queue
        if (_spp_rx_queue == NULL)
        {
            log_e("RX Queue Create Failed");
            return false;
        }
    }
    if (_spp_tx_queue == NULL)
    {
        _spp_tx_queue = xQueueCreate(TX_QUEUE_SIZE, sizeof(spp_packet_t *)); //initialize the queue
        if (_spp_tx_queue == NULL)
        {
            log_e("TX Queue Create Failed");
            return false;
        }
    }
    if (_spp_tx_done == NULL)
    {
        _spp_tx_done = xSemaphoreCreateBinary();
        if (_spp_tx_done == NULL)
        {
            log_e("TX Semaphore Create Failed");
            return false;
        }
        xSemaphoreTake(_spp_tx_done, 0);
    }

    if (!_spp_task_handle)
    {
        xTaskCreatePinnedToCore(_spp_tx_task, "spp_tx", 4096, NULL, 2, &_spp_task_handle, 0);
        if (!_spp_task_handle)
        {
            log_e("Network Event Task Start Failed!");
            return false;
        }
    }

    if (!btStarted() && !btStart())
    {
        log_e("initialize controller failed");
        return false;
    }

    esp_bluedroid_status_t bt_state = esp_bluedroid_get_status();
    if (bt_state == ESP_BLUEDROID_STATUS_UNINITIALIZED)
    {
        if (esp_bluedroid_init())
        {
            log_e("initialize bluedroid failed");
            return false;
        }
    }

    if (bt_state != ESP_BLUEDROID_STATUS_ENABLED)
    {
        if (esp_bluedroid_enable())
        {
            log_e("enable bluedroid failed");
            return false;
        }
    }

    if (_isMaster && esp_bt_gap_register_callback(esp_bt_gap_cb) != ESP_OK)
    {
        log_e("gap register failed");
        return false;
    }

    if (esp_spp_register_callback(esp_spp_cb) != ESP_OK)
    {
        log_e("spp register failed");
        return false;
    }

    if (esp_spp_init(ESP_SPP_MODE_CB) != ESP_OK)
    {
        log_e("spp init failed");
        return false;
    }

    if (esp_bt_sleep_disable() != ESP_OK)
    {
        log_e("esp_bt_sleep_disable failed");
    }

    log_i("device name set");
    esp_bt_dev_set_device_name(deviceName);

    if (_isPinSet)
    {
        btSetPin();
    }

    if (_enableSSP)
    {
        log_i("Simple Secure Pairing");
        esp_bt_sp_param_t param_type = ESP_BT_SP_IOCAP_MODE;
        esp_bt_io_cap_t iocap = ESP_BT_IO_CAP_IO;
        esp_bt_gap_set_security_param(param_type, &iocap, sizeof(uint8_t));
    }

