hisyamfs/esp32-ta/lib/myBluetoothSerial/myBluetoothSerial.cpp
    // the default BTA_DM_COD_LOUDSPEAKER does not work with the macOS BT stack
    esp_bt_cod_t cod;
    cod.major = 0b00001;
    cod.minor = 0b000100;
    cod.service = 0b00000010110;
    if (esp_bt_gap_set_cod(cod, ESP_BT_INIT_COD) != ESP_OK)
    {
        log_e("set cod failed");
        return false;
    }
    return true;
}

static bool _stop_bt()
{
    if (btStarted())
    {
        if (_spp_client)
            esp_spp_disconnect(_spp_client);
        esp_spp_deinit();
        esp_bluedroid_disable();
        esp_bluedroid_deinit();
        btStop();
    }
    _spp_client = 0;
    if (_spp_task_handle)
    {
        vTaskDelete(_spp_task_handle);
        _spp_task_handle = NULL;
    }
    if (_spp_event_group)
    {
        vEventGroupDelete(_spp_event_group);
        _spp_event_group = NULL;
    }
    if (_spp_rx_queue)
    {
        vQueueDelete(_spp_rx_queue);
        //ToDo: clear RX queue when in packet mode
        _spp_rx_queue = NULL;
    }
    if (_spp_tx_queue)
    {
        spp_packet_t *packet = NULL;
        while (xQueueReceive(_spp_tx_queue, &packet, 0) == pdTRUE)
        {
            free(packet);
        }
        vQueueDelete(_spp_tx_queue);
        _spp_tx_queue = NULL;
    }
    if (_spp_tx_done)
    {
        vSemaphoreDelete(_spp_tx_done);
        _spp_tx_done = NULL;
    }
    return true;
}

static bool waitForConnect(int timeout)
{
    TickType_t xTicksToWait = timeout / portTICK_PERIOD_MS;
    return (xEventGroupWaitBits(_spp_event_group, SPP_CONNECTED, pdFALSE, pdTRUE, xTicksToWait) & SPP_CONNECTED) != 0;
}

/*
 * Serial Bluetooth Arduino
 *
 * */

myBluetoothSerial::myBluetoothSerial()
{
    local_name = "ESP32"; //default bluetooth name
}

myBluetoothSerial::~myBluetoothSerial(void)
{
    _stop_bt();
}

bool myBluetoothSerial::begin(String localName, bool isMaster)
{
    _isMaster = isMaster;
    if (localName.length())
    {
        local_name = localName;
    }
    return _init_bt(local_name.c_str());
}

int myBluetoothSerial::available(void)
{
    if (_spp_rx_queue == NULL)
    {
        return 0;
    }
    return uxQueueMessagesWaiting(_spp_rx_queue);
}

int myBluetoothSerial::peek(void)
{
    uint8_t c;
    if (_spp_rx_queue && xQueuePeek(_spp_rx_queue, &c, 0))
    {
        return c;
    }
    return -1;
}

bool myBluetoothSerial::hasClient(void)
{
    return _spp_client > 0;
}

int myBluetoothSerial::read(void)
{

    uint8_t c = 0;
    if (_spp_rx_queue && xQueueReceive(_spp_rx_queue, &c, 0))
    {
        return c;
    }
    return -1;
}

size_t myBluetoothSerial::write(uint8_t c)
{
    return write(&c, 1);
}

size_t myBluetoothSerial::write(const uint8_t *buffer, size_t size)
{
    if (!_spp_client)
    {
        return 0;
    }
    return (_spp_queue_packet((uint8_t *)buffer, size) == ESP_OK) ? size : 0;
}

void myBluetoothSerial::flush()
{
    if (_spp_tx_queue != NULL)
    {
        while (uxQueueMessagesWaiting(_spp_tx_queue) > 0)
        {
            delay(5);
        }
    }
}

void myBluetoothSerial::end()
{
    _stop_bt();
}

esp_err_t myBluetoothSerial::register_callback(esp_spp_cb_t *callback)
{
    custom_spp_callback = callback;
    return ESP_OK;
}

//Simple Secure Pairing
void myBluetoothSerial::enableSSP()
{
    _enableSSP = true;
}
/*
     * Set default parameters for Legacy Pairing
     * Use fixed pin code
*/
bool myBluetoothSerial::setPin(const char *pin)
{
    bool isEmpty = !(pin && *pin);
    if (isEmpty && !_isPinSet)
    {
        return true; // nothing to do
    }
    else if (!isEmpty)
    {
        _pin_len = strlen(pin);
        memcpy(_pin_code, pin, _pin_len);
    }
    else
    {
        _pin_len = 0; // resetting pin to none (default)
    }
    _pin_code[_pin_len] = 0;
    _isPinSet = true;
    if (isReady(false, READY_TIMEOUT))
    {
        btSetPin();
    }
    return true;
}

bool myBluetoothSerial::connect(String remoteName)
{
    if (!isReady(true, READY_TIMEOUT))
        return false;
    if (remoteName && remoteName.length() < 1)
    {
        log_e("No remote name is provided");
        return false;
    }
    disconnect();
    _isRemoteAddressSet = false;
    strncpy(_remote_name, remoteName.c_str(), ESP_BT_GAP_MAX_BDNAME_LEN);
    _remote_name[ESP_BT_GAP_MAX_BDNAME_LEN] = 0;
    log_i("master : remoteName");
    // will first resolve name to address
    esp_bt_gap_set_scan_mode(ESP_BT_SCAN_MODE_CONNECTABLE_DISCOVERABLE);
    if (esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, INQ_LEN, INQ_NUM_RSPS) == ESP_OK)
    {
        return waitForConnect(SCAN_TIMEOUT);
    }
    return false;
}

bool myBluetoothSerial::connect(uint8_t remoteAddress[])
{
    if (!isReady(true, READY_TIMEOUT))
        return false;
    if (!remoteAddress)
    {
        log_e("No remote address is provided");
        return false;
    }
    disconnect();
    _remote_name[0] = 0;
    _isRemoteAddressSet = true;
    memcpy(_peer_bd_addr, remoteAddress, ESP_BD_ADDR_LEN);
    log_i("master : remoteAddress");
    if (esp_spp_start_discovery(_peer_bd_addr) == ESP_OK)
    {
        return waitForConnect(READY_TIMEOUT);
    }
    return false;
}

bool myBluetoothSerial::connect()
{
    if (!isReady(true, READY_TIMEOUT))
        return false;
    if (_isRemoteAddressSet)
    {
        disconnect();
        // use resolved or set address first
        log_i("master : remoteAddress");
        if (esp_spp_start_discovery(_peer_bd_addr) == ESP_OK)
        {
            return waitForConnect(READY_TIMEOUT);
        }
        return false;
    }
    else if (_remote_name[0])
    {
        disconnect();
        log_i("master : remoteName");
        // will resolve name to address first - it may take a while
        esp_bt_gap_set_scan_mode(ESP_BT_SCAN_MODE_CONNECTABLE_DISCOVERABLE);
        if (esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, INQ_LEN, INQ_NUM_RSPS) == ESP_OK)
        {
            return waitForConnect(SCAN_TIMEOUT);
        }
        return false;
    }
    log_e("Neither Remote name nor address was provided");
    return false;
}

bool myBluetoothSerial::disconnect()
{
    if (_spp_client)
    {
        flush();
        log_i("disconnecting");
        if (esp_spp_disconnect(_spp_client) == ESP_OK)
        {
            TickType_t xTicksToWait = READY_TIMEOUT / portTICK_PERIOD_MS;
            return (xEventGroupWaitBits(_spp_event_group, SPP_DISCONNECTED, pdFALSE, pdTRUE, xTicksToWait) & SPP_DISCONNECTED) != 0;
        }
    }
    return false;
}

bool myBluetoothSerial::unpairDevice(uint8_t remoteAddress[])
{
    if (isReady(false, READY_TIMEOUT))
    {
        log_i("removing bonded device");
        return (esp_bt_gap_remove_bond_device(remoteAddress) == ESP_OK);
    }
    return false;
}

bool myBluetoothSerial::connected(int timeout)
{
    return waitForConnect(timeout);
}

bool myBluetoothSerial::isReady(bool checkMaster, int timeout)
{
    if (checkMaster && !_isMaster)
    {
        log_e("Master mode is not active. Call begin(localName, true) to enable Master mode");
        return false;
    }
    if (!btStarted())
    {
        log_e("BT is not initialized. Call begin() first");
        return false;
    }
    TickType_t xTicksToWait = timeout / portTICK_PERIOD_MS;
    return (xEventGroupWaitBits(_spp_event_group, SPP_RUNNING, pdFALSE, pdTRUE, xTicksToWait) & SPP_RUNNING) != 0;
}
#endif
